app/controllers/items_controller.rb

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 4 LIMIT 1
---
	def new
	  @list = List.find(params[:list_id])

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 4 LIMIT 1
INSERT INTO `items` (`comment`, `created_at`, `list_id`, `name`, `updated_at`) VALUES ('test_item', '2006-01-01 00:12:12', 4, 'test_item', '2006-01-01 00:12:12')
---
	def create
	  @list = List.find(params[:list_id])
	  @item = @list.items.new(item_params)
	  if @item.save

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 4 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`list_id` = 4 AND `items`.`id` = 2 LIMIT 1
---
	def edit
	  @list = List.find(params[:list_id])
	  @item = @list.items.find(params[:id])

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 4 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`list_id` = 4 AND `items`.`id` = 2 LIMIT 1
UPDATE `items` SET `comment` = 'list_item', `updated_at` = '2006-01-01 00:25:44' WHERE `items`.`id` = 2
---
	def update
	  @list = List.find(params[:list_id])
	  @item = @list.items.find(params[:id])
	  @item_saved = @item.update_attributes(item_params)

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 4 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`list_id` = 4 AND `items`.`id` = 2 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 2
---
	def destroy
	  @list = List.find(params[:list_id])
	  @item = @list.items.find(params[:id])
	  @destroyed = @item.destroy