app/controllers/lists_controller.rb

	def index
	  @lists = current_user.lists.all
	  if params[:format].present?
		@list_to_show = current_user.lists.find(params[:format])
		if @list_to_show.present?
		  @items = @list_to_show.items
		else
		  @items = nil
		end
	  else
		@list_to_show = current_user.lists.first
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`user_id` = 1 AND `lists`.`id` = 4 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`list_id` = 4

	def create
	  @list = current_user.lists.new(list_params)
	  if @list.save
---
INSERT INTO `lists` (`created_at`, `description`, `name`, `updated_at`, `user_id`) VALUES ('2014-10-04 10:48:13', 'test', 'test', '2014-10-04 10:48:13', 1)

	def destroy
	  @list = List.find(params[:id])
	  @destroyed = @list.destroy
---
SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 5 LIMIT 1
DELETE FROM `lists` WHERE `lists`.`id` = 5